## Santander银行用户产品购买预测项目  
**1、数据集：**  
Santander-product-recommend （经过处理的kaggle数据集，测试集约53万条数据）  
**2、项目成果：**  
① 数据探索&数据清洗：在对特征数据进行探索后发现部分特征存在数据缺失的情况，对于缺失值较少的特征，我直接用0或999作为替代进行补入；同时，对于用户特征数据全部缺失的行我直接予以了剔除；对于收入数据，我觉得收入对于新产品类型的购买存在较为显著的影响，故对于缺失值我没有直接采用平均值的方式进行补全，而是用Xgboost先行进行了一次预测，采用预测值作为补全数据。  
② 特征构造：在本次项目中我添加了2个新特征作为特征变量（a、use_time特征用以反映用户对于银行的忠诚度，越是老用户越有可能购买小众产品；b、month_label特征用以反应不同产品在不同月度的购买情况）。  
③ 目标列构造：由于在测试集中每一行给出的是用户当月的产品持有情况，而问题是需要预测用户未来会购买产品的情况；故我对目标数据进行了处理，当某个用户ID首次出现时，我认为该月其持有的产品为其新购买的产品；而后续每个月与上个月进行进行差分，当差分结果为1时表明该用户这个月购买了该产品，当差分结果为-1时表明该用户这个月出售了该产品，当差分结果为0时表明该用户该月未对产品进行操作；由此可以得到新的目标矩阵；在对目标矩阵进行聚合后得到用户新购买产品的标签。由于需要解决的问题是用户新购买不同产品的概率，即隐藏假定是用户一定会购买产品，故我在处理目标列时将不购买产品的行全部删去以减少训练的数据量级。  
④ 模型训练：采用Xgboost模型进行训练，并输出不同产品的购买概率矩阵，对每行选取概率最高的前七个产品进行输出，得到预测集数据。  
